{"format":"graph-model","generatedBy":"1.14.0","convertedBy":"TensorFlow.js Converter v1.2.6","modelTopology":{"node":[{"name":"sub_2","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}}},{"name":"MobilenetV1/offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},{"name":"clip_by_value/Minimum/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"34"}]}}}}},{"name":"MobilenetV1/heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"32"}]}}}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["sub_2","MobilenetV1/Conv2d_0/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_0/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_0/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_0/Relu6","MobilenetV1/Conv2d_1_depthwise/depthwise_weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_1_depthwise/Relu6","MobilenetV1/Conv2d_1_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_1_pointwise/Relu6","MobilenetV1/Conv2d_2_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_2_depthwise/Relu6","MobilenetV1/Conv2d_2_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_2_pointwise/Relu6","MobilenetV1/Conv2d_3_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_3_depthwise/Relu6","MobilenetV1/Conv2d_3_pointwise/weights"],"attr":{"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_3_pointwise/Relu6","MobilenetV1/Conv2d_4_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_4_depthwise/Relu6","MobilenetV1/Conv2d_4_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_4_pointwise/Relu6","MobilenetV1/Conv2d_5_depthwise/depthwise_weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_5_depthwise/Relu6","MobilenetV1/Conv2d_5_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_5_pointwise/Relu6","MobilenetV1/Conv2d_6_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_6_depthwise/Relu6","MobilenetV1/Conv2d_6_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_6_pointwise/Relu6","MobilenetV1/Conv2d_7_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_7_depthwise/Relu6","MobilenetV1/Conv2d_7_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_7_pointwise/Relu6","MobilenetV1/Conv2d_8_depthwise/depthwise_weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_8_depthwise/Relu6","MobilenetV1/Conv2d_8_pointwise/weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_8_pointwise/Relu6","MobilenetV1/Conv2d_9_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_9_depthwise/Relu6","MobilenetV1/Conv2d_9_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_9_pointwise/Relu6","MobilenetV1/Conv2d_10_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_10_depthwise/Relu6","MobilenetV1/Conv2d_10_pointwise/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_10_pointwise/Relu6","MobilenetV1/Conv2d_11_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_11_depthwise/Relu6","MobilenetV1/Conv2d_11_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_11_pointwise/Relu6","MobilenetV1/Conv2d_12_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_12_depthwise/Relu6","MobilenetV1/Conv2d_12_pointwise/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_12_pointwise/Relu6","MobilenetV1/Conv2d_13_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["4","4","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_depthwise/Relu6","MobilenetV1/Conv2d_13_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_short_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_segments/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/segment_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_offset_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"float_part_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_heatmap_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"float_long_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/embedding_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"float_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/heatmap_2/weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_fwd_2/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_bwd_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"float_short_offsets","op":"BiasAdd","input":["float_short_offsets/conv","MobilenetV1/offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_segments","op":"BiasAdd","input":["float_segments/conv","MobilenetV1/segment_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"add_1","op":"BiasAdd","input":["add_1/conv","MobilenetV1/part_offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_part_heatmaps","op":"BiasAdd","input":["float_part_heatmaps/conv","MobilenetV1/part_heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_long_offsets","op":"BiasAdd","input":["float_long_offsets/conv","MobilenetV1/embedding_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_heatmaps","op":"BiasAdd","input":["float_heatmaps/conv","MobilenetV1/heatmap_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_fwd_2/BiasAdd/conv","MobilenetV1/displacement_fwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_bwd_2/BiasAdd/conv","MobilenetV1/displacement_bwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"clip_by_value/Minimum","op":"Minimum","input":["add_1","clip_by_value/Minimum/y"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_part_offsets","op":"Maximum","input":["clip_by_value/Minimum","clip_by_value/y"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":38}},"weightsManifest":[{"paths":["group1-shard1of2.bin","group1-shard2of2.bin"],"weights":[{"name":"MobilenetV1/offset_2/Conv2D_bias","shape":[34],"dtype":"float32","quantization":{"min":-0.021897082256899736,"scale":5.180289154695939e-7,"dtype":"uint16"}},{"name":"MobilenetV1/offset_2/weights","shape":[1,1,1024,34],"dtype":"float32","quantization":{"min":-1.1238897102152154,"scale":0.00003086506770151362,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","shape":[1024],"dtype":"float32","quantization":{"min":-28.47319156480543,"scale":0.0009011073980886584,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","shape":[1,1,1024,1024],"dtype":"float32","quantization":{"min":-3.461613184616096,"scale":0.00009736486891728113,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","shape":[1024],"dtype":"float32","quantization":{"min":-7.002168285443798,"scale":0.0002186605966163007,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","shape":[3,3,1024,1],"dtype":"float32","quantization":{"min":-44.24320691563385,"scale":0.0010194287307749735,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","shape":[1024],"dtype":"float32","quantization":{"min":-11.78794001879568,"scale":0.00031063402600389165,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","shape":[1,1,512,1024],"dtype":"float32","quantization":{"min":-0.6584035390682311,"scale":0.00002027853699236883,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-6.844139229653765,"scale":0.00019728292487183687,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-1.848258022582803,"scale":0.00029657542082522513,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.871023085548993,"scale":0.0002413489793652463,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.5578480012167453,"scale":0.00001895958947818867,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.056785705035544,"scale":0.00021735150817512528,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-3.2931836728983472,"scale":0.00022213717861034382,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.407602823507306,"scale":0.00023936235796462083,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.43321502435904957,"scale":0.00001588148047360692,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-9.190429145287364,"scale":0.0002548437219667627,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-16.593479178118617,"scale":0.0006865604360179824,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-4.470808817871541,"scale":0.0001413381644496567,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.5110449132515854,"scale":0.000018798782904233415,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.930493140342517,"scale":0.00024888504376407435,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-4.528723960720612,"scale":0.00012136470482970954,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-5.547285476618213,"scale":0.00016898030573346572,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.6164125138656257,"scale":0.000019942816456877468,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-10.075279038556518,"scale":0.00026156647468928367,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-5.666039639300736,"scale":0.0001487344701220826,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-3.428760712532573,"scale":0.0001614142129993679,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.49107872241420314,"scale":0.000014483107394172387,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-6.9984729354438135,"scale":0.00024231261461961823,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-7.947007706062176,"scale":0.0002594009565890513,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-7.097022245830135,"scale":0.00024557170400796313,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","shape":[1,1,256,512],"dtype":"float32","quantization":{"min":-1.3571296669993567,"scale":0.0000350172790535493,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-2.260073324216443,"scale":0.0001984958127715126,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-22.450582167332275,"scale":0.0007050619360383228,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-8.394098025466244,"scale":0.00019188264128071697,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.008272744549342,"scale":0.000030325816426532186,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-5.630912556891639,"scale":0.00025744845267427027,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.9503497357061783,"scale":0.0002163806186803211,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-9.784590256262346,"scale":0.0003086621531943958,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","shape":[1,1,128,256],"dtype":"float32","quantization":{"min":-1.3882119100626995,"scale":0.000043736985194161924,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","shape":[128],"dtype":"float32","quantization":{"min":-16.33737626115399,"scale":0.0003816876448182135,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"min":-1.8194297193671434,"scale":0.00038588117059748533,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","shape":[128],"dtype":"float32","quantization":{"min":-7.678614285827692,"scale":0.00029793249857710364,"dtype":"uint16"}},