{"format":"graph-model","generatedBy":"1.14.0","convertedBy":"TensorFlow.js Converter v1.2.6","modelTopology":{"node":[{"name":"sub_2","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}}},{"name":"MobilenetV1/offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/Minimum/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},{"name":"MobilenetV1/part_heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}}}},{"name":"MobilenetV1/embedding_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["sub_2","MobilenetV1/Conv2d_0/weights"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_0/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_0/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_0/Relu6","MobilenetV1/Conv2d_1_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_1_depthwise/Relu6","MobilenetV1/Conv2d_1_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_1_pointwise/Relu6","MobilenetV1/Conv2d_2_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_2_depthwise/Relu6","MobilenetV1/Conv2d_2_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_2_pointwise/Relu6","MobilenetV1/Conv2d_3_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_3_depthwise/Relu6","MobilenetV1/Conv2d_3_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_3_pointwise/Relu6","MobilenetV1/Conv2d_4_depthwise/depthwise_weights"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_4_depthwise/Relu6","MobilenetV1/Conv2d_4_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_4_pointwise/Relu6","MobilenetV1/Conv2d_5_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_5_depthwise/Relu6","MobilenetV1/Conv2d_5_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_5_pointwise/Relu6","MobilenetV1/Conv2d_6_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_6_depthwise/Relu6","MobilenetV1/Conv2d_6_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_6_pointwise/Relu6","MobilenetV1/Conv2d_7_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_7_depthwise/Relu6","MobilenetV1/Conv2d_7_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_7_pointwise/Relu6","MobilenetV1/Conv2d_8_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_8_depthwise/Relu6","MobilenetV1/Conv2d_8_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_8_pointwise/Relu6","MobilenetV1/Conv2d_9_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_9_depthwise/Relu6","MobilenetV1/Conv2d_9_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_9_pointwise/Relu6","MobilenetV1/Conv2d_10_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_10_depthwise/Relu6","MobilenetV1/Conv2d_10_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_10_pointwise/Relu6","MobilenetV1/Conv2d_11_depthwise/depthwise_weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_11_depthwise/Relu6","MobilenetV1/Conv2d_11_pointwise/weights"],"attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_11_pointwise/Relu6","MobilenetV1/Conv2d_12_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_12_depthwise/Relu6","MobilenetV1/Conv2d_12_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_12_pointwise/Relu6","MobilenetV1/Conv2d_13_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["4","4","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_depthwise/Relu6","MobilenetV1/Conv2d_13_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_short_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"float_segments/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/segment_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"float_part_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_heatmap_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_long_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/embedding_2/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"float_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/heatmap_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_fwd_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_bwd_2/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"float_short_offsets","op":"BiasAdd","input":["float_short_offsets/conv","MobilenetV1/offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_segments","op":"BiasAdd","input":["float_segments/conv","MobilenetV1/segment_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"add_1","op":"BiasAdd","input":["add_1/conv","MobilenetV1/part_offset_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"float_part_heatmaps","op":"BiasAdd","input":["float_part_heatmaps/conv","MobilenetV1/part_heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_long_offsets","op":"BiasAdd","input":["float_long_offsets/conv","MobilenetV1/embedding_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_heatmaps","op":"BiasAdd","input":["float_heatmaps/conv","MobilenetV1/heatmap_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_fwd_2/BiasAdd/conv","MobilenetV1/displacement_fwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_bwd_2/BiasAdd/conv","MobilenetV1/displacement_bwd_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/Minimum","op":"Minimum","input":["add_1","clip_by_value/Minimum/y"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_part_offsets","op":"Maximum","input":["clip_by_value/Minimum","clip_by_value/y"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":38}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"MobilenetV1/offset_2/Conv2D_bias","shape":[34],"dtype":"float32","quantization":{"min":-0.02183388272921244,"scale":0.00013313343127568562,"dtype":"uint8"}},{"name":"MobilenetV1/offset_2/weights","shape":[1,1,1024,34],"dtype":"float32","quantization":{"min":-1.126389780699038,"scale":0.007932322399289,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","shape":[1024],"dtype":"float32","quantization":{"min":-28.484905960980583,"scale":0.23158460130878522,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","shape":[1,1,1024,1024],"dtype":"float32","quantization":{"min":-3.4531424410202924,"scale":0.02502277131174125,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","shape":[1024],"dtype":"float32","quantization":{"min":-7.02447166629866,"scale":0.05619577333038928,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","shape":[3,3,1024,1],"dtype":"float32","quantization":{"min":-44.276848063749426,"scale":0.2619931838091682,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","shape":[1024],"dtype":"float32","quantization":{"min":-11.815275813084023,"scale":0.07983294468300016,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","shape":[1,1,512,1024],"dtype":"float32","quantization":{"min":-0.6566595848868875,"scale":0.00521158400703879,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-6.844731078428381,"scale":0.05070171169206208,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-1.8292771956499885,"scale":0.07621988315208285,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.869816340652166,"scale":0.062026687696868296,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.5554780525319716,"scale":0.004872614495894488,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.043744614545037,"scale":0.0558593376010072,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-3.311176784365785,"scale":0.05708925490285836,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.427709261576336,"scale":0.061516125996907554,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.4326432910619997,"scale":0.004081540481716979,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-9.169277116364123,"scale":0.06549483654545803,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-16.58592701332242,"scale":0.1764460320566215,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-4.467840716418098,"scale":0.03632390826356177,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.5121164438771266,"scale":0.0048312872063879875,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-8.954883874631395,"scale":0.06396345624736711,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-4.522655725479126,"scale":0.03119072914123535,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-5.558776137408088,"scale":0.04342793857350069,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.6150364595301011,"scale":0.005125303829417509,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-10.083387599271887,"scale":0.06722258399514591,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-5.657264305563534,"scale":0.03822475882137523,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-3.4431265774895166,"scale":0.04148345274083755,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"min":-0.49132493523990406,"scale":0.0037221586003023037,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","shape":[512],"dtype":"float32","quantization":{"min":-6.97472629921109,"scale":0.06227434195724188,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"min":-7.933259455362957,"scale":0.06666604584338619,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","shape":[512],"dtype":"float32","quantization":{"min":-7.068535928165211,"scale":0.06311192793004652,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","shape":[1,1,256,512],"dtype":"float32","quantization":{"min":-1.3589155482310873,"scale":0.008999440716762168,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-2.2445906508202644,"scale":0.05101342388227874,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-22.46891377766927,"scale":0.18120091756184895,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-8.383352597554525,"scale":0.049313838809144264,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.0053917919888216,"scale":0.007793734821618772,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-5.623961448669434,"scale":0.06616425233728745,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.947320407044654,"scale":0.055609819000842525,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-9.757119324628045,"scale":0.07932617337095971,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","shape":[1,1,128,256],"dtype":"float32","quantization":{"min":-1.3938102441675524,"scale":0.011240405194899616,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","shape":[128],"dtype":"float32","quantization":{"min":-16.381652027952907,"scale":0.09809372471828087,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"min":-1.7850862951839672,"scale":0.09917146084355373,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","shape":[128],"dtype":"float32","quantization":{"min":-7.656865213431565,"scale":0.07656865213431564,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","shape":[1,1,128,128],"dtype":"float32","quantization":{"min":-1.6895213674096499,"scale":0.017065872398077272,"dtype":"uint8"}},