{"format":"graph-model","generatedBy":"1.14.0","convertedBy":"TensorFlow.js Converter v1.2.6","modelTopology":{"node":[{"name":"sub_2","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}}},{"name":"MobilenetV1/offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/Minimum/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},{"name":"MobilenetV1/part_offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["sub_2","MobilenetV1/Conv2d_0/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_0/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_0/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_0/Relu6","MobilenetV1/Conv2d_1_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_1_depthwise/Relu6","MobilenetV1/Conv2d_1_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_1_pointwise/Relu6","MobilenetV1/Conv2d_2_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_2_depthwise/Relu6","MobilenetV1/Conv2d_2_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_2_pointwise/Relu6","MobilenetV1/Conv2d_3_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_3_depthwise/Relu6","MobilenetV1/Conv2d_3_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_3_pointwise/Relu6","MobilenetV1/Conv2d_4_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_4_depthwise/Relu6","MobilenetV1/Conv2d_4_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_4_pointwise/Relu6","MobilenetV1/Conv2d_5_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_5_depthwise/Relu6","MobilenetV1/Conv2d_5_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_5_pointwise/Relu6","MobilenetV1/Conv2d_6_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_6_depthwise/Relu6","MobilenetV1/Conv2d_6_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_6_pointwise/Relu6","MobilenetV1/Conv2d_7_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_7_depthwise/Relu6","MobilenetV1/Conv2d_7_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_7_pointwise/Relu6","MobilenetV1/Conv2d_8_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_8_depthwise/Relu6","MobilenetV1/Conv2d_8_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_8_pointwise/Relu6","MobilenetV1/Conv2d_9_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_9_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_9_depthwise/Relu6","MobilenetV1/Conv2d_9_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_9_pointwise/Relu6","MobilenetV1/Conv2d_10_depthwise/depthwise_weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_10_depthwise/Relu6","MobilenetV1/Conv2d_10_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_10_pointwise/Relu6","MobilenetV1/Conv2d_11_depthwise/depthwise_weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_11_depthwise/Relu6","MobilenetV1/Conv2d_11_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_11_pointwise/Relu6","MobilenetV1/Conv2d_12_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_12_depthwise/Relu6","MobilenetV1/Conv2d_12_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_12_pointwise/Relu6","MobilenetV1/Conv2d_13_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_depthwise/Relu6","MobilenetV1/Conv2d_13_pointwise/weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_short_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_segments/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/segment_2/weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_offset_2/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"float_part_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_heatmap_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_long_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/embedding_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"float_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/heatmap_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_fwd_2/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_bwd_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},{"name":"float_short_offsets","op":"BiasAdd","input":["float_short_offsets/conv","MobilenetV1/offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_segments","op":"BiasAdd","input":["float_segments/conv","MobilenetV1/segment_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"add_1","op":"BiasAdd","input":["add_1/conv","MobilenetV1/part_offset_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"float_part_heatmaps","op":"BiasAdd","input":["float_part_heatmaps/conv","MobilenetV1/part_heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_long_offsets","op":"BiasAdd","input":["float_long_offsets/conv","MobilenetV1/embedding_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"float_heatmaps","op":"BiasAdd","input":["float_heatmaps/conv","MobilenetV1/heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_fwd_2/BiasAdd/conv","MobilenetV1/displacement_fwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_bwd_2/BiasAdd/conv","MobilenetV1/displacement_bwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"clip_by_value/Minimum","op":"Minimum","input":["add_1","clip_by_value/Minimum/y"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_part_offsets","op":"Maximum","input":["clip_by_value/Minimum","clip_by_value/y"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":38}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"MobilenetV1/offset_2/Conv2D_bias","shape":[34],"dtype":"float32","quantization":{"min":-0.08780409869025735,"scale":0.0005453670726102941,"dtype":"uint8"}},{"name":"MobilenetV1/offset_2/weights","shape":[1,1,384,34],"dtype":"float32","quantization":{"min":-0.8013693851583145,"scale":0.0062121657764210424,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-3.3089104596306296,"scale":0.029810004140816485,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-1.365431967903586,"scale":0.010923455743228687,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-2.0286104258368995,"scale":0.016228883406695198,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-2.278206544763902,"scale":0.021697205188227636,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-1.0659072329016293,"scale":0.008527257863213034,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-0.5561495240996865,"scale":0.004379130111021154,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-6.03015391031901,"scale":0.039934794108072914,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-2.2397424473482017,"scale":0.020177859886019837,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-10.24102014653823,"scale":0.06650013082167681,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-1.3077385346094768,"scale":0.009982736905415852,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-6.368176561243394,"scale":0.057370960011201746,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-3.224839984669405,"scale":0.024430605944465188,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-7.701613661822151,"scale":0.05348342820709827,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-0.8862301999447393,"scale":0.007089841599557914,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-21.598456954956053,"scale":0.11190910339355468,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-3.0584583095475737,"scale":0.02184613078248267,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-9.528676350911459,"scale":0.0560510373583027,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-1.226947630152983,"scale":0.010762698510113885,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-9.758249574549058,"scale":0.07998565225040212,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-3.5487962386187384,"scale":0.02751004836138557,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-5.535909381567263,"scale":0.050788159463919846,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-1.0487561366137337,"scale":0.008323461401696299,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-8.651668485005697,"scale":0.07937310536702474,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-3.8047461977192003,"scale":0.029958631478103938,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-3.924335911694695,"scale":0.03442399922539206,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","shape":[1,1,384,384],"dtype":"float32","quantization":{"min":-0.6765108978047091,"scale":0.006263989794488047,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","shape":[384],"dtype":"float32","quantization":{"min":-15.308088283912808,"scale":0.08457507339178347,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","shape":[3,3,384,1],"dtype":"float32","quantization":{"min":-3.3459311316995057,"scale":0.02655500898174211,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","shape":[384],"dtype":"float32","quantization":{"min":-8.253311538696288,"scale":0.08091481900682636,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","shape":[1,1,192,384],"dtype":"float32","quantization":{"min":-2.1723452343660243,"scale":0.017661343368829466,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","shape":[192],"dtype":"float32","quantization":{"min":-2.4615022042218375,"scale":0.03673883886898265,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","shape":[3,3,192,1],"dtype":"float32","quantization":{"min":-1.516578929564532,"scale":0.015015632965985466,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","shape":[192],"dtype":"float32","quantization":{"min":-5.1418713924931545,"scale":0.06270574868894091,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","shape":[1,1,192,192],"dtype":"float32","quantization":{"min":-4.759837599361645,"scale":0.03173225066241096,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","shape":[192],"dtype":"float32","quantization":{"min":-7.207699966430664,"scale":0.07066372516108495,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","shape":[3,3,192,1],"dtype":"float32","quantization":{"min":-4.04849973192402,"scale":0.031628904155656404,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","shape":[192],"dtype":"float32","quantization":{"min":-18.85728753781786,"scale":0.1346949109844133,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","shape":[1,1,96,192],"dtype":"float32","quantization":{"min":-2.251051285687615,"scale":0.018758760714063457,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","shape":[96],"dtype":"float32","quantization":{"min":-9.206271534340054,"scale":0.08603992088168275,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","shape":[3,3,96,1],"dtype":"float32","quantization":{"min":-1.6033899176354502,"scale":0.012930563851898792,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","shape":[96],"dtype":"float32","quantization":{"min":-34.66448457755294,"scale":0.17160635929481655,"dtype":"uint8"}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","shape":[1,1,96,96],"dtype":"float32","quantization":{"min":-12.62397392497343,"scale":0.08587737363927504,"dtype":"uint8"}},