{"weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"dtype": "float32", "shape": [1, 12], "name": "constant_mask_14"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_12"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_11"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_13"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_10"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_9"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_8"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_1"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_2"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_3"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_4"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_5"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_6"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_mask_7"}, {"dtype": "float32", "shape": [1, 12], "name": "constant_cls"}, {"dtype": "float32", "shape": [1, 1, 1280, 12], "name": "logits_scene/w"}, {"dtype": "int32", "shape": [], "name": "one_hot/depth"}, {"dtype": "float32", "shape": [], "name": "one_hot/on_value"}, {"dtype": "float32", "shape": [], "name": "one_hot/off_value"}, {"dtype": "float32", "shape": [1, 2], "name": "constant_quality"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "mobilenetv2/res5_1/ex_dim/w"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "mobilenetv2/res2_1/ex_dim/w"}, {"dtype": "int32", "shape": [2], "name": "mobilenetv2/global_avg/Mean/reduction_indices"}, {"dtype": "float32", "shape": [1, 1, 1280, 2], "name": "logits_quality/w"}, {"dtype": "int32", "shape": [2], "name": "Flatten/flatten/Reshape/shape"}, {"dtype": "int32", "shape": [], "name": "ArgMax/dimension"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "mobilenetv2/conv1_1/conv2d/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/conv1_1/conv1_1/conv2d/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "mobilenetv2/res2_1/pw/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/res2_1/res2_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "mobilenetv2/res2_1/dw/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/res2_1/res2_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "mobilenetv2/res2_1/pw_linear/w"}, {"dtype": "float32", "shape": [16], "name": "mobilenetv2/res2_1/res2_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 16, 96], "name": "mobilenetv2/res3_1/pw/w"}, {"dtype": "float32", "shape": [96], "name": "mobilenetv2/res3_1/res3_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 96, 1], "name": "mobilenetv2/res3_1/dw/w"}, {"dtype": "float32", "shape": [96], "name": "mobilenetv2/res3_1/res3_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 96, 24], "name": "mobilenetv2/res3_1/pw_linear/w"}, {"dtype": "float32", "shape": [24], "name": "mobilenetv2/res3_1/res3_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 24, 144], "name": "mobilenetv2/res3_2/pw/w"}, {"dtype": "float32", "shape": [144], "name": "mobilenetv2/res3_2/res3_2/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 144, 1], "name": "mobilenetv2/res3_2/dw/w"}, {"dtype": "float32", "shape": [144], "name": "mobilenetv2/res3_2/res3_2/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 144, 24], "name": "mobilenetv2/res3_2/pw_linear/w"}, {"dtype": "float32", "shape": [24], "name": "mobilenetv2/res3_2/res3_2/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 24, 144], "name": "mobilenetv2/res4_1/pw/w"}, {"dtype": "float32", "shape": [144], "name": "mobilenetv2/res4_1/res4_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 144, 1], "name": "mobilenetv2/res4_1/dw/w"}, {"dtype": "float32", "shape": [144], "name": "mobilenetv2/res4_1/res4_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 144, 32], "name": "mobilenetv2/res4_1/pw_linear/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/res4_1/res4_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "mobilenetv2/res4_2/pw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res4_2/res4_2/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "mobilenetv2/res4_2/dw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res4_2/res4_2/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 32], "name": "mobilenetv2/res4_2/pw_linear/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/res4_2/res4_2/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "mobilenetv2/res4_3/pw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res4_3/res4_3/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "mobilenetv2/res4_3/dw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res4_3/res4_3/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 32], "name": "mobilenetv2/res4_3/pw_linear/w"}, {"dtype": "float32", "shape": [32], "name": "mobilenetv2/res4_3/res4_3/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "mobilenetv2/res5_1/pw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res5_1/res5_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "mobilenetv2/res5_1/dw/w"}, {"dtype": "float32", "shape": [192], "name": "mobilenetv2/res5_1/res5_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "mobilenetv2/res5_1/pw_linear/w"}, {"dtype": "float32", "shape": [64], "name": "mobilenetv2/res5_1/res5_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "mobilenetv2/res5_2/pw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_2/res5_2/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "mobilenetv2/res5_2/dw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_2/res5_2/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "mobilenetv2/res5_2/pw_linear/w"}, {"dtype": "float32", "shape": [64], "name": "mobilenetv2/res5_2/res5_2/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "mobilenetv2/res5_3/pw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_3/res5_3/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "mobilenetv2/res5_3/dw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_3/res5_3/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "mobilenetv2/res5_3/pw_linear/w"}, {"dtype": "float32", "shape": [64], "name": "mobilenetv2/res5_3/res5_3/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "mobilenetv2/res5_4/pw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_4/res5_4/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "mobilenetv2/res5_4/dw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res5_4/res5_4/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "mobilenetv2/res5_4/pw_linear/w"}, {"dtype": "float32", "shape": [64], "name": "mobilenetv2/res5_4/res5_4/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "mobilenetv2/res6_1/pw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res6_1/res6_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "mobilenetv2/res6_1/dw/w"}, {"dtype": "float32", "shape": [384], "name": "mobilenetv2/res6_1/res6_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 384, 96], "name": "mobilenetv2/res6_1/pw_linear/w"}, {"dtype": "float32", "shape": [96], "name": "mobilenetv2/res6_1/res6_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "mobilenetv2/res6_2/pw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res6_2/res6_2/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "mobilenetv2/res6_2/dw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res6_2/res6_2/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 576, 96], "name": "mobilenetv2/res6_2/pw_linear/w"}, {"dtype": "float32", "shape": [96], "name": "mobilenetv2/res6_2/res6_2/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "mobilenetv2/res6_3/pw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res6_3/res6_3/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "mobilenetv2/res6_3/dw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res6_3/res6_3/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 576, 96], "name": "mobilenetv2/res6_3/pw_linear/w"}, {"dtype": "float32", "shape": [96], "name": "mobilenetv2/res6_3/res6_3/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "mobilenetv2/res7_1/pw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res7_1/res7_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "mobilenetv2/res7_1/dw/w"}, {"dtype": "float32", "shape": [576], "name": "mobilenetv2/res7_1/res7_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 576, 160], "name": "mobilenetv2/res7_1/pw_linear/w"}, {"dtype": "float32", "shape": [160], "name": "mobilenetv2/res7_1/res7_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "mobilenetv2/res7_2/pw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res7_2/res7_2/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "mobilenetv2/res7_2/dw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res7_2/res7_2/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 960, 160], "name": "mobilenetv2/res7_2/pw_linear/w"}, {"dtype": "float32", "shape": [160], "name": "mobilenetv2/res7_2/res7_2/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "mobilenetv2/res7_3/pw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res7_3/res7_3/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "mobilenetv2/res7_3/dw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res7_3/res7_3/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 960, 160], "name": "mobilenetv2/res7_3/pw_linear/w"}, {"dtype": "float32", "shape": [160], "name": "mobilenetv2/res7_3/res7_3/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "mobilenetv2/res8_1/pw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res8_1/res8_1/pw/pw/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "mobilenetv2/res8_1/dw/w"}, {"dtype": "float32", "shape": [960], "name": "mobilenetv2/res8_1/res8_1/dw/depthwise_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 960, 320], "name": "mobilenetv2/res8_1/pw_linear/w"}, {"dtype": "float32", "shape": [320], "name": "mobilenetv2/res8_1/res8_1/pw_linear/pw_linear/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 1280], "name": "mobilenetv2/conv9_1/pwb/w"}, {"dtype": "float32", "shape": [1280], "name": "mobilenetv2/conv9_1/conv9_1/pwb/pwb/Conv2D_bn_offset"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_14", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_12", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_11", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_13", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_10", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_9", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_8", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_2", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_4", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_5", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_6", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_mask_7", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}}, "name": "constant_cls", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "12"}]}}}}, "name": "logits_scene/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "one_hot/depth", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "one_hot/on_value", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "one_hot/off_value", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}, "name": "constant_quality", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}}, "name": "mobilenetv2/res5_1/ex_dim/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}}, "name": "mobilenetv2/res2_1/ex_dim/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "image", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "mobilenetv2/global_avg/Mean/reduction_indices", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "2"}]}}}}, "name": "logits_quality/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "Flatten/flatten/Reshape/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ArgMax/dimension", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}, "name": "mobilenetv2/conv1_1/conv2d/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/conv1_1/conv1_1/conv2d/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}}, "name": "mobilenetv2/res2_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/res2_1/res2_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res2_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/res2_1/res2_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}}, "name": "mobilenetv2/res2_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}, "name": "mobilenetv2/res2_1/res2_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}}}}, "name": "mobilenetv2/res3_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "mobilenetv2/res3_1/res3_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res3_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "mobilenetv2/res3_1/res3_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}}}}, "name": "mobilenetv2/res3_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "mobilenetv2/res3_1/res3_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}, "name": "mobilenetv2/res3_2/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "mobilenetv2/res3_2/res3_2/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res3_2/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "mobilenetv2/res3_2/res3_2/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}}}}, "name": "mobilenetv2/res3_2/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "mobilenetv2/res3_2/res3_2/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}, "name": "mobilenetv2/res4_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "mobilenetv2/res4_1/res4_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res4_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "mobilenetv2/res4_1/res4_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "32"}]}}}}, "name": "mobilenetv2/res4_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/res4_1/res4_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "mobilenetv2/res4_2/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res4_2/res4_2/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res4_2/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res4_2/res4_2/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}, "name": "mobilenetv2/res4_2/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/res4_2/res4_2/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "mobilenetv2/res4_3/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res4_3/res4_3/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res4_3/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res4_3/res4_3/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}, "name": "mobilenetv2/res4_3/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mobilenetv2/res4_3/res4_3/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "mobilenetv2/res5_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res5_1/res5_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res5_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "mobilenetv2/res5_1/res5_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}}, "name": "mobilenetv2/res5_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "mobilenetv2/res5_1/res5_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "mobilenetv2/res5_2/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_2/res5_2/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res5_2/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_2/res5_2/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "mobilenetv2/res5_2/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "mobilenetv2/res5_2/res5_2/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "mobilenetv2/res5_3/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_3/res5_3/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res5_3/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_3/res5_3/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "mobilenetv2/res5_3/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "mobilenetv2/res5_3/res5_3/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "mobilenetv2/res5_4/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_4/res5_4/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res5_4/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res5_4/res5_4/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "mobilenetv2/res5_4/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "mobilenetv2/res5_4/res5_4/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "mobilenetv2/res6_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res6_1/res6_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res6_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "mobilenetv2/res6_1/res6_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}, "name": "mobilenetv2/res6_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "mobilenetv2/res6_1/res6_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "mobilenetv2/res6_2/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res6_2/res6_2/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res6_2/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res6_2/res6_2/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}}, "name": "mobilenetv2/res6_2/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "mobilenetv2/res6_2/res6_2/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "mobilenetv2/res6_3/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res6_3/res6_3/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res6_3/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res6_3/res6_3/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}}, "name": "mobilenetv2/res6_3/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "mobilenetv2/res6_3/res6_3/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "mobilenetv2/res7_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res7_1/res7_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res7_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "mobilenetv2/res7_1/res7_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "160"}]}}}}, "name": "mobilenetv2/res7_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "mobilenetv2/res7_1/res7_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "mobilenetv2/res7_2/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res7_2/res7_2/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res7_2/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res7_2/res7_2/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "name": "mobilenetv2/res7_2/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "mobilenetv2/res7_2/res7_2/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "mobilenetv2/res7_3/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res7_3/res7_3/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res7_3/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res7_3/res7_3/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "name": "mobilenetv2/res7_3/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "mobilenetv2/res7_3/res7_3/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "mobilenetv2/res8_1/pw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res8_1/res8_1/pw/pw/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "mobilenetv2/res8_1/dw/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "mobilenetv2/res8_1/res8_1/dw/depthwise_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "320"}]}}}}, "name": "mobilenetv2/res8_1/pw_linear/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}}, "name": "mobilenetv2/res8_1/res8_1/pw_linear/pw_linear/Conv2D_bn_offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "1280"}]}}}}, "name": "mobilenetv2/conv9_1/pwb/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "name": "mobilenetv2/conv9_1/conv9_1/pwb/pwb/Conv2D_bn_offset", "op": "Const"}, {"device": "/device:CPU:0", "input": ["image", "mobilenetv2/conv1_1/conv2d/w", "mobilenetv2/conv1_1/conv1_1/conv2d/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}, "name": "mobilenetv2/conv1_1/conv1_1/relu6", "op": "_FusedConv2D"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/conv1_1/conv1_1/relu6", "mobilenetv2/res2_1/ex_dim/w"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "mobilenetv2/res2_1/res2_1/ex_dim/ex_dim/Conv2D", "op": "Conv2D"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/conv1_1/conv1_1/relu6", "mobilenetv2/res2_1/pw/w", "mobilenetv2/res2_1/res2_1/pw/pw/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}, "name": "mobilenetv2/res2_1/res2_1/relu6", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res2_1/res2_1/relu6", "mobilenetv2/res2_1/dw/w"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res2_1/res2_1/dw/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["mobilenetv2/res2_1/res2_1/dw/depthwise", "mobilenetv2/res2_1/res2_1/dw/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res2_1/res2_1/dw_bn/FusedBatchNorm", "op": "BiasAdd"}, {"input": ["mobilenetv2/res2_1/res2_1/dw_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res2_1/res2_1/relu6_1", "op": "Relu6"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res2_1/res2_1/relu6_1", "mobilenetv2/res2_1/pw_linear/w", "mobilenetv2/res2_1/res2_1/pw_linear/pw_linear/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "name": "mobilenetv2/res2_1/res2_1/pw_linear_bn/FusedBatchNorm", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res2_1/res2_1/ex_dim/ex_dim/Conv2D", "mobilenetv2/res2_1/res2_1/pw_linear_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res2_1/res2_1/add", "op": "Add"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res2_1/res2_1/add", "mobilenetv2/res3_1/pw/w", "mobilenetv2/res3_1/res3_1/pw/pw/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}, "name": "mobilenetv2/res3_1/res3_1/relu6", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res3_1/res3_1/relu6", "mobilenetv2/res3_1/dw/w"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res3_1/res3_1/dw/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["mobilenetv2/res3_1/res3_1/dw/depthwise", "mobilenetv2/res3_1/res3_1/dw/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res3_1/res3_1/dw_bn/FusedBatchNorm", "op": "BiasAdd"}, {"input": ["mobilenetv2/res3_1/res3_1/dw_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res3_1/res3_1/relu6_1", "op": "Relu6"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res3_1/res3_1/relu6_1", "mobilenetv2/res3_1/pw_linear/w", "mobilenetv2/res3_1/res3_1/pw_linear/pw_linear/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "name": "mobilenetv2/res3_1/res3_1/pw_linear_bn/FusedBatchNorm", "op": "_FusedConv2D"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res3_1/res3_1/pw_linear_bn/FusedBatchNorm", "mobilenetv2/res3_2/pw/w", "mobilenetv2/res3_2/res3_2/pw/pw/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}, "name": "mobilenetv2/res3_2/res3_2/relu6", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res3_2/res3_2/relu6", "mobilenetv2/res3_2/dw/w"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res3_2/res3_2/dw/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["mobilenetv2/res3_2/res3_2/dw/depthwise", "mobilenetv2/res3_2/res3_2/dw/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res3_2/res3_2/dw_bn/FusedBatchNorm", "op": "BiasAdd"}, {"input": ["mobilenetv2/res3_2/res3_2/dw_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res3_2/res3_2/relu6_1", "op": "Relu6"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res3_2/res3_2/relu6_1", "mobilenetv2/res3_2/pw_linear/w", "mobilenetv2/res3_2/res3_2/pw_linear/pw_linear/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "name": "mobilenetv2/res3_2/res3_2/pw_linear_bn/FusedBatchNorm", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res3_1/res3_1/pw_linear_bn/FusedBatchNorm", "mobilenetv2/res3_2/res3_2/pw_linear_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res3_2/res3_2/add", "op": "Add"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res3_2/res3_2/add", "mobilenetv2/res4_1/pw/w", "mobilenetv2/res4_1/res4_1/pw/pw/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}, "name": "mobilenetv2/res4_1/res4_1/relu6", "op": "_FusedConv2D"}, {"input": ["mobilenetv2/res4_1/res4_1/relu6", "mobilenetv2/res4_1/dw/w"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res4_1/res4_1/dw/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["mobilenetv2/res4_1/res4_1/dw/depthwise", "mobilenetv2/res4_1/res4_1/dw/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "mobilenetv2/res4_1/res4_1/dw_bn/FusedBatchNorm", "op": "BiasAdd"}, {"input": ["mobilenetv2/res4_1/res4_1/dw_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "mobilenetv2/res4_1/res4_1/relu6_1", "op": "Relu6"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res4_1/res4_1/relu6_1", "mobilenetv2/res4_1/pw_linear/w", "mobilenetv2/res4_1/res4_1/pw_linear/pw_linear/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "name": "mobilenetv2/res4_1/res4_1/pw_linear_bn/FusedBatchNorm", "op": "_FusedConv2D"}, {"device": "/device:CPU:0", "input": ["mobilenetv2/res4_1/res4_1/pw_linear_bn/FusedBatchNorm", "mobilenetv2/res4_2/pw/w", "mobilenetv2/res4_2/res4_2/pw/pw/Conv2D_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": 