{"format":"graph-model","generatedBy":"1.14.0","convertedBy":"TensorFlow.js Converter v1.2.6","modelTopology":{"node":[{"name":"sub_2","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Conv2D_bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"MobilenetV1/Conv2d_1_pointwise/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/segment_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"clip_by_value/Minimum/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_offset_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/part_heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/embedding_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/heatmap_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"17"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_fwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/Conv2D_bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["sub_2","MobilenetV1/Conv2d_0/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_0/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_0/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_0/Relu6","MobilenetV1/Conv2d_1_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_1_depthwise/Relu6","MobilenetV1/Conv2d_1_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_1_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_1_pointwise/Relu6","MobilenetV1/Conv2d_2_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_2_depthwise/Relu6","MobilenetV1/Conv2d_2_pointwise/weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_2_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_2_pointwise/Relu6","MobilenetV1/Conv2d_3_depthwise/depthwise_weights"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_3_depthwise/Relu6","MobilenetV1/Conv2d_3_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_3_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_3_pointwise/Relu6","MobilenetV1/Conv2d_4_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_4_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_4_depthwise/Relu6","MobilenetV1/Conv2d_4_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_4_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_4_pointwise/Relu6","MobilenetV1/Conv2d_5_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_5_depthwise/Relu6","MobilenetV1/Conv2d_5_pointwise/weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_5_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_5_pointwise/Relu6","MobilenetV1/Conv2d_6_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_6_depthwise/Relu6","MobilenetV1/Conv2d_6_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_6_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_6_pointwise/Relu6","MobilenetV1/Conv2d_7_depthwise/depthwise_weights"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_7_depthwise/Relu6","MobilenetV1/Conv2d_7_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_7_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_7_pointwise/Relu6","MobilenetV1/Conv2d_8_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_8_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_8_depthwise/Relu6","MobilenetV1/Conv2d_8_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_8_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_8_pointwise/Relu6","MobilenetV1/Conv2d_9_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_9_depthwise/Relu6","MobilenetV1/Conv2d_9_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_9_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_9_pointwise/Relu6","MobilenetV1/Conv2d_10_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_depthwise/depthwise_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_10_depthwise/Relu6","MobilenetV1/Conv2d_10_pointwise/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_10_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_10_pointwise/Relu6","MobilenetV1/Conv2d_11_depthwise/depthwise_weights"],"attr":{"dilations":{"list":{"i":["2","2","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_11_depthwise/Relu6","MobilenetV1/Conv2d_11_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_11_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_11_pointwise/Relu6","MobilenetV1/Conv2d_12_depthwise/depthwise_weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_12_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_12_depthwise/Relu6","MobilenetV1/Conv2d_12_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_12_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","op":"DepthwiseConv2dNative","input":["MobilenetV1/Conv2d_12_pointwise/Relu6","MobilenetV1/Conv2d_13_depthwise/depthwise_weights"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["2","2","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_depthwise/depthwise_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_depthwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_depthwise/Relu6","MobilenetV1/Conv2d_13_pointwise/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1","op":"BiasAdd","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv","MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/Conv2d_13_pointwise/Relu6","op":"Relu6","input":["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_short_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_segments/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/segment_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"add_1/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_offset_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"float_part_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/part_heatmap_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"float_long_offsets/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/embedding_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},{"name":"float_heatmaps/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/heatmap_2/weights"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_fwd_2/weights"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd/conv","op":"Conv2D","input":["MobilenetV1/Conv2d_13_pointwise/Relu6","MobilenetV1/displacement_bwd_2/weights"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},{"name":"float_short_offsets","op":"BiasAdd","input":["float_short_offsets/conv","MobilenetV1/offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_segments","op":"BiasAdd","input":["float_segments/conv","MobilenetV1/segment_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"add_1","op":"BiasAdd","input":["add_1/conv","MobilenetV1/part_offset_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_part_heatmaps","op":"BiasAdd","input":["float_part_heatmaps/conv","MobilenetV1/part_heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_long_offsets","op":"BiasAdd","input":["float_long_offsets/conv","MobilenetV1/embedding_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"float_heatmaps","op":"BiasAdd","input":["float_heatmaps/conv","MobilenetV1/heatmap_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"MobilenetV1/displacement_fwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_fwd_2/BiasAdd/conv","MobilenetV1/displacement_fwd_2/Conv2D_bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},{"name":"MobilenetV1/displacement_bwd_2/BiasAdd","op":"BiasAdd","input":["MobilenetV1/displacement_bwd_2/BiasAdd/conv","MobilenetV1/displacement_bwd_2/Conv2D_bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"clip_by_value/Minimum","op":"Minimum","input":["add_1","clip_by_value/Minimum/y"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"float_part_offsets","op":"Maximum","input":["clip_by_value/Minimum","clip_by_value/y"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":38}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"MobilenetV1/offset_2/Conv2D_bias","shape":[34],"dtype":"float32","quantization":{"min":-0.07279997268539459,"scale":0.000001975254305551188,"dtype":"uint16"}},{"name":"MobilenetV1/offset_2/weights","shape":[1,1,256,34],"dtype":"float32","quantization":{"min":-0.9906415613908885,"scale":0.000029793731169650783,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-2.4968743947766106,"scale":0.00011955920296765996,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.9176377166297076,"scale":0.000060392331956971237,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-2.0519359914663684,"scale":0.00006620429733065652,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_13_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.0056951628548427,"scale":0.00008108077628066631,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-1.0766829006948577,"scale":0.000038146426951102135,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-0.802792323693409,"scale":0.00002251051015599947,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-3.511732056547086,"scale":0.0001197235802722994,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_12_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-3.3635086265446676,"scale":0.00011834589305600322,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-8.703430090432965,"scale":0.00033793166726588873,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.180557087237733,"scale":0.00003916781418127245,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-8.716195469858665,"scale":0.0002692177992914092,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_11_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-1.9212905112453025,"scale":0.00006146556117618858,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-10.36361600161781,"scale":0.00035388820220651565,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.4193150161614525,"scale":0.000050264370016696264,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-13.12200883859681,"scale":0.00034518884722988403,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_10_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.263847674131666,"scale":0.00006670932561679827,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-8.169989426923468,"scale":0.0002723602169191409,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.6848105987731603,"scale":0.00005311508823370619,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-14.3397426485315,"scale":0.00042317602102731215,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_9_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.6283227950073065,"scale":0.00007891913268698374,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-6.549890698198415,"scale":0.00021859929573802406,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-1.0183573113686888,"scale":0.00003629472205320012,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-10.2873531649767,"scale":0.0002692460522659312,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_8_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-4.40680383137419,"scale":0.00013443164733760988,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-4.6879742448331925,"scale":0.00015259836088777034,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_pointwise/weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"min":-0.8795265144101996,"scale":0.000027014974180981034,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_bias","shape":[256],"dtype":"float32","quantization":{"min":-4.9177314936200665,"scale":0.00017352004141067944,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_7_depthwise/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"min":-2.902723738562736,"scale":0.00008907065999456062,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_pointwise/Conv2D_bias","shape":[256],"dtype":"float32","quantization":{"min":-19.89185664182107,"scale":0.0008387172341283076,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_pointwise/weights","shape":[1,1,128,256],"dtype":"float32","quantization":{"min":-3.4864915529304796,"scale":0.00010360736836737332,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_bias","shape":[128],"dtype":"float32","quantization":{"min":-1.129539444943701,"scale":0.00018003497687977385,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_6_depthwise/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"min":-1.3021117437055911,"scale":0.00004730994963142067,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_pointwise/Conv2D_bias","shape":[128],"dtype":"float32","quantization":{"min":-22.0311325425986,"scale":0.0005173084564337043,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_pointwise/weights","shape":[1,1,128,128],"dtype":"float32","quantization":{"min":-3.5208770706332175,"scale":0.00009191210668110835,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_bias","shape":[128],"dtype":"float32","quantization":{"min":-8.13998310849897,"scale":0.0003541432720686957,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_5_depthwise/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"min":-5.0125842203198605,"scale":0.00014259741182066058,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_pointwise/Conv2D_bias","shape":[128],"dtype":"float32","quantization":{"min":-11.63709431438922,"scale":0.00028902700529988376,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_pointwise/weights","shape":[1,1,64,128],"dtype":"float32","quantization":{"min":-2.610619914261584,"scale":0.00009345337083449378,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_bias","shape":[64],"dtype":"float32","quantization":{"min":-5.658165252822628,"scale":0.0001915360093707941,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_4_depthwise/depthwise_weights","shape":[3,3,64,1],"dtype":"float32","quantization":{"min":-1.7867513345127712,"scale":0.00005174190126586271,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_3_pointwise/Conv2D_bias","shape":[64],"dtype":"float32","quantization":{"min":-54.27100386776367,"scale":0.0013080817534229234,"dtype":"uint16"}},{"name":"MobilenetV1/Conv2d_3_pointwise/weights","shape":[1,1,64,64],